In [3]:
import numpy as np
import pandas as pd

In [2]:
%%file dataset.csv
id,x,y,z
0,1,1,3
1,1,0,9
2,1,3,
3,2,0,10
4,1,,4
5,2,2,3

Overwriting dataset.csv

In [14]:
df = pd.read_csv('dataset.csv', index_col=0)

In [17]:
df

    col_x  col_y  col_z
id
0       1    1.0    3.0
1       1    0.0    9.0
2       1    3.0    NaN
3       2    0.0   10.0
4       1    NaN    4.0
5       2    2.0    3.0

In [16]:
df = df.rename(columns={'x' : 'col_x', 'y' : 'col_y', 'z' : 'col_z'})

In [18]:
df

    col_x  col_y  col_z
id
0       1    1.0    3.0
1       1    0.0    9.0
2       1    3.0    NaN
3       2    0.0   10.0
4       1    NaN    4.0
5       2    2.0    3.0

In [23]:
df = df.fillna(0)
df = df.astype(int)

In [24]:
df

    col_x  col_y  col_z
id
0       1      1      3
1       1      0      9
2       1      3      0
3       2      0     10
4       1      0      4
5       2      2      3

In [26]:
df = df.drop([1, 3, 4], axis=0)